# Ultralytics YOLOv10 + Your Custom Backbone
# Custom model config using BackboneNet defined in mymodel.py
# Save this file as /ultralytics/cfg/models/V10/mymodel.yaml

# Ultralytics YOLOv10 + Your Custom Backbone

nc: 7
scales:
  s: [0.33, 0.50, 1024]

backbone:

  - [-1, 1, BackboneNet, [3, 8, 7]]# 输出3通道
  - [ -1, 1, Conv, [ 64, 3, 2 ] ]
  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 1-P2/4
  - [ -1, 3, C2f, [ 128, True ] ]
  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 3-P3/8
  - [ -1, 6, C2f, [ 256, True ] ]
  - [ -1, 1, SCDown, [ 512, 3, 2 ] ] # 5-P4/16
  - [ -1, 6, C2f, [ 512, True ] ]
  - [ -1, 1, SCDown, [ 1024, 3, 2 ] ] # 7-P5/32
  - [ -1, 3, C2fCIB, [ 1024, True, True ] ]
  - [ -1, 1, SPPF, [ 1024, 5 ] ] # 9
  - [ -1, 1, PSA, [ 1024 ] ] # 10

  # YOLOv10.0n head
head:
  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
  - [ [ -1, 6 ], 1, Concat, [ 1 ] ] # cat backbone P4
  - [ -1, 3, C2f, [ 512 ] ] # 13

  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
  - [ [ -1, 4 ], 1, Concat, [ 1 ] ] # cat backbone P3
  - [ -1, 3, C2f, [ 256 ] ] # 16 (P3/8-small)

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [ [ -1, 13 ], 1, Concat, [ 1 ] ] # cat head P4
  - [ -1, 3, C2f, [ 512 ] ] # 19 (P4/16-medium)

  - [ -1, 1, SCDown, [ 512, 3, 2 ] ]
  - [ [ -1, 10 ], 1, Concat, [ 1 ] ] # cat head P5
  - [ -1, 3, C2fCIB, [ 1024, True, True ] ] # 22 (P5/32-large)

  - [ [ 16, 19, 22 ], 1, v10Detect, [ nc ] ] # Detect(P3, P4, P5)




